Including background SQL code because unable to find URL/DB

In [94]:
import sqlite3
conn = sqlite3.connect('proj3.db')
cursor = conn.cursor()

In [95]:
cursor.execute('DROP TABLE Customer')
cursor.execute('DROP TABLE Invoice')
cursor.execute('DROP TABLE Tracks')
cursor.execute('DROP TABLE Songs')
cursor.execute('DROP TABLE Albums')

cursor.execute('CREATE TABLE Customer(CustomerId INT, LastName TEXT, FirstName TEXT)')
cursor.execute('CREATE TABLE Invoice(InvoiceId INT, CustomerID INT, TrackId INT)')
cursor.execute('CREATE TABLE Tracks(TrackId INT, SongID INT, AlbumId INT)')
cursor.execute('CREATE TABLE Songs(SongId INT, Song TEXT)')
cursor.execute('CREATE TABLE Albums(AlbumId INT, Album TEXT)')

cursor.execute("INSERT INTO Customer VALUES('100', 'Almeida', 'Roberto')")
cursor.execute("INSERT INTO Invoice VALUES('300', '100', '1')")
cursor.execute("INSERT INTO Invoice VALUES('300', '100', '2')")
cursor.execute("INSERT INTO Invoice VALUES('300', '100', '3')")
cursor.execute("INSERT INTO Tracks VALUES('1', '1', '1')")
cursor.execute("INSERT INTO Songs VALUES('1', 'Right Next Door to Hell')")
cursor.execute("INSERT INTO Albums VALUES('1', 'Sex Machine')")
cursor.execute("INSERT INTO Tracks VALUES('2', '2', '2')")
cursor.execute("INSERT INTO Songs VALUES('2', 'In The Evening')")
cursor.execute("INSERT INTO Albums VALUES('2', 'Maquinarama')")
cursor.execute("INSERT INTO Tracks VALUES('3', '3', '3')")
cursor.execute("INSERT INTO Songs VALUES('3', 'Fool In The Rain')")
cursor.execute("INSERT INTO Albums VALUES('3', 'O Samba Pocone')")
cursor.execute("INSERT INTO Customer Values('101', 'Bach', 'Johann')")
cursor.execute("INSERT INTO Invoice VALUES('300', '101', '1')")
cursor.execute("INSERT INTO Invoice VALUES('300', '101', '4')")
cursor.execute("INSERT INTO Tracks VALUES('4', '4', '4')")
cursor.execute("INSERT INTO Songs VALUES('4', 'Because')")
cursor.execute("INSERT INTO Albums VALUES('4', 'Abbey Road')")

conn.commit()

# Project 3
Create Connection to SQL DB

In [96]:
import sqlite3
import pandas as pd
import sqlalchemy

engine = sqlalchemy.create_engine('sqlite:///proj3.db')

Run SQL Query

In [97]:
pd.read_sql("""SELECT LastName, FirstName, Song, Album 
               FROM Customer C, Invoice I, Tracks T, Songs S, Albums A
               WHERE C.CustomerId = I.CustomerId
               AND I.TrackId = T.TrackId
               AND T.TrackId = S.SongId
               AND T.AlbumId = A.AlbumId
               ORDER BY LastName, FirstName""", engine)

  LastName FirstName                     Song           Album
0  Almeida   Roberto  Right Next Door to Hell     Sex Machine
1  Almeida   Roberto           In The Evening     Maquinarama
2  Almeida   Roberto         Fool In The Rain  O Samba Pocone
3     Bach    Johann  Right Next Door to Hell     Sex Machine
4     Bach    Johann                  Because      Abbey Road